htibosch/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
    return pdFALSE;
}


/*  Task to output the data to the network interface. This allows the network stack to continue
 *  processing while the data is able to be sent. */
static void prvEMACDeferredInterfaceOutputTaskTX( void * pvParameters )
{
    struct NetworkInterfaceDataOut NIDataOutput;

    for( ; ; )
    {
        ulTaskNotifyTakeIndexed( TX_QUEPOS_FIRST_EVENT, pdTRUE, portMAX_DELAY );
        xQueueReceive( xQueueTX, &NIDataOutput, 0 );

        /* For ICMP packets, the checksum must be zero if the network hardware computes the checksum or the buffer will not be properly sent
         * For this driver it is required that ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM == 1 */
        ProtocolPacket_t * pxPacket;
        pxPacket = ( ProtocolPacket_t * ) ( NIDataOutput.pxDescriptor->pucEthernetBuffer );

        if( pxPacket->xICMPPacket.xIPHeader.ucProtocol == ( uint8_t ) ipPROTOCOL_ICMP )
        {
            pxPacket->xICMPPacket.xICMPHeader.usChecksum = ( uint16_t ) 0u;
        }

        taskENTER_CRITICAL();
        packetTransmit( NIDataOutput.pxDescriptor->pucEthernetBuffer, ( uint32_t ) NIDataOutput.pxDescriptor->xDataLength );
        taskEXIT_CRITICAL();

        /* wait until transmit */
        ulTaskNotifyTakeIndexed( TX_QUEPOS_SECOND_EVENT, pdTRUE, portMAX_DELAY );
        iptraceNETWORK_INTERFACE_TRANSMIT();

        if( NIDataOutput.xReleaseAfterSend )
        {
            vReleaseNetworkBufferAndDescriptor( NIDataOutput.pxDescriptor );
        }
    }
}


/*  Function to output packets to the network.
 *  Called directly by FreeRTOS. This function should not block and therefore passes
 *  all output data to a queue.  If the function blocks the network stack can become unresponsive
 *  so all of the output work is thereby done by another task. */
BaseType_t xNetworkInterfaceOutput( NetworkBufferDescriptor_t * const pxDescriptor,
                                    BaseType_t xReleaseAfterSend )
{
    struct NetworkInterfaceDataOut NIDataOutput;
    BaseType_t txResp;
    BaseType_t returnValue = pdFALSE;
    BaseType_t xDescriptorUsed = pdFALSE;

    /* When the following assert is hit, please make sure that
     * ipconfigZERO_COPY_TX_DRIVER is defined as '1' in your
     * FreeRTOSIPConfig.h header file. */
    configASSERT( xReleaseAfterSend != pdFALSE );

    if( networkUP != pdFALSE )
    {
        NIDataOutput.pxDescriptor = pxDescriptor;
        NIDataOutput.xReleaseAfterSend = xReleaseAfterSend;
        txResp = xQueueSend( xQueueTX, &NIDataOutput, 0 );

        if( txResp == pdTRUE )
        {
            xTaskNotifyGiveIndexed( xTaskToNotifyEthernetTX, 0 );
            returnValue = pdTRUE;
            xDescriptorUsed = pdTRUE;
        }
    }
    else
    {
        /* The PHY has no Link Status, packet shall be dropped. */
    }

    if( xDescriptorUsed == pdFALSE )
    {
        vReleaseNetworkBufferAndDescriptor( pxDescriptor );
    }

    return returnValue;
}


/*
 * -----------------------------------------------------------------------------------------------------
 * Network interface UP or DOWN tasks and associated functions
 * -----------------------------------------------------------------------------------------------------
 */

/*  Function to check and see if the network is up or down by polling a register in the Ethernet driver.
 *  Apparently there is no other way to do this other than polling.  The register is checked for link status,
 *  but also for remote faults and this takes into consideration a pulled Ethernet cable during RX and TX.
 */
static bool isEMACLinkUp()
{
    uint8_t uci8PHYAddr = 0; /* refers to the internal PHY */
    uint16_t check;
    BaseType_t returnValue = pdFALSE;

    check = EMACPHYRead( EMAC0_BASE, uci8PHYAddr, EPHY_BMSR );

    if( ( ( check & EPHY_BMSR_LINKSTAT ) != 0 ) && !( check & EPHY_BMSR_RFAULT ) )
    {
        returnValue = pdTRUE; /* link is up */
    }

    return returnValue; /* return link status  */
}


/* A task to check and see if the link is up or down by polling an EMAC register */
static void prvCheckLinkUpOrDownNetStateTask( void * pvParameters )
{
    bool checkLinkStatus = false;

    for( ; ; )
    {
        checkLinkStatus = isEMACLinkUp();

        if( ( checkLinkStatus == true ) && ( networkUP == false ) )
        {
            networkUP = true;
        }
        else if( ( checkLinkStatus == false ) && ( networkUP == true ) )
        {
            /*   FreeRTOS will poll xNetworkInterfaceInitialise() to check if the network is up.
             *   So after FreeRTOS_NetworkDown() is called, there is no corresponding FreeRTOS_NetworkUp() function...
             */
            networkUP = false;
            FreeRTOS_NetworkDown();
        }

        if( resetNetwork == true )
        {
            vPublicTurnOffEMAC();
            vPublicTurnOnEMAC();
            resetNetwork = false;
        }

        /* As the above code never seems to sleep, it is maybe good to call vTaskDelay() */
        vTaskDelay( pdMS_TO_TICKS( CHECK_LINK_UP_DOWN_DELAY_MS ) );
    }
}


/* Call this network function to physically turn on the EMAC from an internal task. */
static bool vPublicTurnOnEMAC()
{
    if( hasBeenSetup == false )
    {
        return false;
    }

    setupEMAC();

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        FreeRTOS_NetworkDown();
        vTaskResume( xHandleCheckLinkUpOrDown );
        vTaskResume( xHandleCheckNet );
        vTaskResume( xTaskToNotifyEthernetRX );
        vTaskResume( xTaskToNotifyEthernetTX );
    }

    return true;
}


/*  Call this function to physically turn off the EMAC from an external task.
 *  It is recommended to check the network stack for open sockets before calling this task,
 *  and only call the task after all sockets are closed and there are no connected clients.
 *  In an operational sense, the best way to turn off the EMAC is to do a hard reset. */
static bool vPublicTurnOffEMAC()
{
    if( hasBeenSetup == false )
    {
        return false; /* make sure that the MAC has been setup */
    }

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        vTaskSuspend( xHandleCheckLinkUpOrDown );
        vTaskSuspend( xHandleCheckNet );
        vTaskSuspend( xTaskToNotifyEthernetRX );
        vTaskSuspend( xTaskToNotifyEthernetTX );
    }

    networkUP = false;

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        FreeRTOS_NetworkDown();                           /* Indicate to FreeRTOS that the network is down */
        vTaskDelay( pdMS_TO_TICKS( ETH_DOWN_DELAY_MS ) ); /* Wait until FreeRTOS has finished processing */
    }

